Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_uart_cmsis.c
static uint32_t UART0_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart0_NonBlockingDriverState);
}

static int32_t UART0_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return UART_NonBlockingControl(control, arg, &uart0_NonBlockingDriverState);
}

static ARM_USART_STATUS UART0_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart0_NonBlockingDriverState);
}

/* uart0 Driver Control Block */
ARM_DRIVER_USART UART0_NonBlocking_Driver = {UARTx_GetVersion,
                                             UARTx_GetCapabilities,
                                             UART0_NonBlockingInitialize,
                                             UART0_NonBlockingUninitialize,
                                             UART0_NonBlockingPowerControl,
                                             UART0_NonBlockingSend,
                                             UART0_NonBlockingReceive,
                                             UART0_NonBlockingTransfer,
                                             UART0_NonBlockingGetTxCount,
                                             UART0_NonBlockingGetRxCount,
                                             UART0_NonBlockingControl,
                                             UART0_NonBlockingGetStatus,
                                             UARTx_SetModemControl,
                                             UARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_uart_dma_resource_t uart0_DmaResource = {
    RTE_UART0_DMA_TX_DMA_BASE, RTE_UART0_DMA_TX_CH, RTE_UART0_DMA_TX_DMAMUX_BASE, RTE_UART0_DMA_TX_PERI_SEL,

    RTE_UART0_DMA_RX_DMA_BASE, RTE_UART0_DMA_RX_CH, RTE_UART0_DMA_RX_DMAMUX_BASE, RTE_UART0_DMA_RX_PERI_SEL,
};

uart_dma_handle_t UART0_DmaHandle;
dma_handle_t UART0_DmaRxHandle;
dma_handle_t UART0_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart0_dma_driver_state")
cmsis_uart_dma_driver_state_t uart0_DmaDriverState = {
#else
cmsis_uart_dma_driver_state_t uart0_DmaDriverState = {
#endif
    &uart0_Resource, &uart0_DmaResource, &UART0_DmaHandle, &UART0_DmaRxHandle, &UART0_DmaTxHandle,
};

static int32_t UART0_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART0_InitPins();
    return UART_DmaInitialize(cb_event, &uart0_DmaDriverState);
}

static int32_t UART0_DmaUninitialize(void)
{
    UART0_DeinitPins();
    return UART_DmaUninitialize(&uart0_DmaDriverState);
}

static int32_t UART0_DmaPowerControl(ARM_POWER_STATE state)
{
    return UART_DmaPowerControl(state, &uart0_DmaDriverState);
}

static int32_t UART0_DmaSend(const void *data, uint32_t num)
{
    return UART_DmaSend(data, num, &uart0_DmaDriverState);
}

static int32_t UART0_DmaReceive(void *data, uint32_t num)
{
    return UART_DmaReceive(data, num, &uart0_DmaDriverState);
}

static int32_t UART0_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_DmaTransfer(data_out, data_in, num, &uart0_DmaDriverState);
}

static uint32_t UART0_DmaGetTxCount(void)
{
    return UART_DmaGetTxCount(&uart0_DmaDriverState);
}

static uint32_t UART0_DmaGetRxCount(void)
{
    return UART_DmaGetRxCount(&uart0_DmaDriverState);
}

static int32_t UART0_DmaControl(uint32_t control, uint32_t arg)
{
    return UART_DmaControl(control, arg, &uart0_DmaDriverState);
}

static ARM_USART_STATUS UART0_DmaGetStatus(void)
{
    return UART_DmaGetStatus(&uart0_DmaDriverState);
}

/* uart0 Driver Control Block */
ARM_DRIVER_USART UART0_Dma_Driver = {
    UARTx_GetVersion, UARTx_GetCapabilities, UART0_DmaInitialize,   UART0_DmaUninitialize, UART0_DmaPowerControl,
    UART0_DmaSend,    UART0_DmaReceive,      UART0_DmaTransfer,     UART0_DmaGetTxCount,   UART0_DmaGetRxCount,
    UART0_DmaControl, UART0_DmaGetStatus,    UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_uart_edma_resource_t uart0_EdmaResource = {
    RTE_UART0_DMA_TX_DMA_BASE, RTE_UART0_DMA_TX_CH, RTE_UART0_DMA_TX_DMAMUX_BASE, RTE_UART0_DMA_TX_PERI_SEL,

    RTE_UART0_DMA_RX_DMA_BASE, RTE_UART0_DMA_RX_CH, RTE_UART0_DMA_RX_DMAMUX_BASE, RTE_UART0_DMA_RX_PERI_SEL,
};

uart_edma_handle_t UART0_EdmaHandle;
edma_handle_t UART0_EdmaRxHandle;
edma_handle_t UART0_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart0_edma_driver_state")
cmsis_uart_edma_driver_state_t uart0_EdmaDriverState = {
#else
cmsis_uart_edma_driver_state_t uart0_EdmaDriverState = {
#endif
    &uart0_Resource, &uart0_EdmaResource, &UART0_EdmaHandle, &UART0_EdmaRxHandle, &UART0_EdmaTxHandle,
};

static int32_t UART0_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART0_InitPins();
    return UART_EdmaInitialize(cb_event, &uart0_EdmaDriverState);
}

static int32_t UART0_EdmaUninitialize(void)
{
    UART0_DeinitPins();
    return UART_EdmaUninitialize(&uart0_EdmaDriverState);
}

static int32_t UART0_EdmaPowerControl(ARM_POWER_STATE state)
{
    return UART_EdmaPowerControl(state, &uart0_EdmaDriverState);
}

static int32_t UART0_EdmaSend(const void *data, uint32_t num)
{
    return UART_EdmaSend(data, num, &uart0_EdmaDriverState);
}

static int32_t UART0_EdmaReceive(void *data, uint32_t num)
{
    return UART_EdmaReceive(data, num, &uart0_EdmaDriverState);
}

static int32_t UART0_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_EdmaTransfer(data_out, data_in, num, &uart0_EdmaDriverState);
}

static uint32_t UART0_EdmaGetTxCount(void)
{
    return UART_EdmaGetTxCount(&uart0_EdmaDriverState);
}

static uint32_t UART0_EdmaGetRxCount(void)
{
    return UART_EdmaGetRxCount(&uart0_EdmaDriverState);
}

static int32_t UART0_EdmaControl(uint32_t control, uint32_t arg)
{
    return UART_EdmaControl(control, arg, &uart0_EdmaDriverState);
}

static ARM_USART_STATUS UART0_EdmaGetStatus(void)
{
    return UART_EdmaGetStatus(&uart0_EdmaDriverState);
}

/* uart0 Driver Control Block */
ARM_DRIVER_USART UART0_Edma_Driver = {
    UARTx_GetVersion,  UARTx_GetCapabilities, UART0_EdmaInitialize,  UART0_EdmaUninitialize, UART0_EdmaPowerControl,
    UART0_EdmaSend,    UART0_EdmaReceive,     UART0_EdmaTransfer,    UART0_EdmaGetTxCount,   UART0_EdmaGetRxCount,
    UART0_EdmaControl, UART0_EdmaGetStatus,   UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

