Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_uart_cmsis.c
static int32_t UART2_EdmaPowerControl(ARM_POWER_STATE state)
{
    return UART_EdmaPowerControl(state, &uart2_EdmaDriverState);
}

static int32_t UART2_EdmaSend(const void *data, uint32_t num)
{
    return UART_EdmaSend(data, num, &uart2_EdmaDriverState);
}

static int32_t UART2_EdmaReceive(void *data, uint32_t num)
{
    return UART_EdmaReceive(data, num, &uart2_EdmaDriverState);
}

static int32_t UART2_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_EdmaTransfer(data_out, data_in, num, &uart2_EdmaDriverState);
}

static uint32_t UART2_EdmaGetTxCount(void)
{
    return UART_EdmaGetTxCount(&uart2_EdmaDriverState);
}

static uint32_t UART2_EdmaGetRxCount(void)
{
    return UART_EdmaGetRxCount(&uart2_EdmaDriverState);
}

static int32_t UART2_EdmaControl(uint32_t control, uint32_t arg)
{
    return UART_EdmaControl(control, arg, &uart2_EdmaDriverState);
}

static ARM_USART_STATUS UART2_EdmaGetStatus(void)
{
    return UART_EdmaGetStatus(&uart2_EdmaDriverState);
}

/* uart2 Driver Control Block */
ARM_DRIVER_USART UART2_Edma_Driver = {
    UARTx_GetVersion,  UARTx_GetCapabilities, UART2_EdmaInitialize,  UART2_EdmaUninitialize, UART2_EdmaPowerControl,
    UART2_EdmaSend,    UART2_EdmaReceive,     UART2_EdmaTransfer,    UART2_EdmaGetTxCount,   UART2_EdmaGetRxCount,
    UART2_EdmaControl, UART2_EdmaGetStatus,   UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /* uart2 */

#if defined(UART3)

extern uint32_t UART3_GetFreq(void);
extern void UART3_InitPins(void);
extern void UART3_DeinitPins(void);

cmsis_uart_resource_t uart3_Resource = {UART3, UART3_GetFreq};

uart_handle_t UART3_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart3_non_blocking_driver_state")
cmsis_uart_interrupt_driver_state_t uart3_NonBlockingDriverState = {
#else
cmsis_uart_interrupt_driver_state_t uart3_NonBlockingDriverState = {
#endif
    &uart3_Resource, &UART3_Handle,
};

static int32_t UART3_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART3_InitPins();
    return UART_NonBlockingInitialize(cb_event, &uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingUninitialize(void)
{
    UART3_DeinitPins();
    return UART_NonBlockingUninitialize(&uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    return UART_NonBlockingPowerControl(state, &uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingSend(const void *data, uint32_t num)
{
    return UART_NonBlockingSend(data, num, &uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingReceive(void *data, uint32_t num)
{
    return UART_NonBlockingReceive(data, num, &uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_NonBlockingTransfer(data_out, data_in, num, &uart3_NonBlockingDriverState);
}

static uint32_t UART3_NonBlockingGetTxCount(void)
{
    return UART_NonBlockingGetTxCount(&uart3_NonBlockingDriverState);
}

static uint32_t UART3_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart3_NonBlockingDriverState);
}

static int32_t UART3_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return UART_NonBlockingControl(control, arg, &uart3_NonBlockingDriverState);
}

static ARM_USART_STATUS UART3_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart3_NonBlockingDriverState);
}

/* uart3 Driver Control Block */
ARM_DRIVER_USART UART3_NonBlocking_Driver = {UARTx_GetVersion,
                                             UARTx_GetCapabilities,
                                             UART3_NonBlockingInitialize,
                                             UART3_NonBlockingUninitialize,
                                             UART3_NonBlockingPowerControl,
                                             UART3_NonBlockingSend,
                                             UART3_NonBlockingReceive,
                                             UART3_NonBlockingTransfer,
                                             UART3_NonBlockingGetTxCount,
                                             UART3_NonBlockingGetRxCount,
                                             UART3_NonBlockingControl,
                                             UART3_NonBlockingGetStatus,
                                             UARTx_SetModemControl,
                                             UARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_uart_dma_resource_t uart3_DmaResource = {
    RTE_UART3_DMA_TX_DMA_BASE, RTE_UART3_DMA_TX_CH, RTE_UART3_DMA_TX_DMAMUX_BASE, RTE_UART3_DMA_TX_PERI_SEL,

    RTE_UART3_DMA_RX_DMA_BASE, RTE_UART3_DMA_RX_CH, RTE_UART3_DMA_RX_DMAMUX_BASE, RTE_UART3_DMA_RX_PERI_SEL,
};

uart_dma_handle_t UART3_DmaHandle;
dma_handle_t UART3_DmaRxHandle;
dma_handle_t UART3_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart3_dma_driver_state")
cmsis_uart_dma_driver_state_t uart3_DmaDriverState = {
#else
cmsis_uart_dma_driver_state_t uart3_DmaDriverState = {
#endif
    &uart3_Resource, &uart3_DmaResource, &UART3_DmaHandle, &UART3_DmaRxHandle, &UART3_DmaTxHandle};

static int32_t UART3_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART3_InitPins();
    return UART_DmaInitialize(cb_event, &uart3_DmaDriverState);
}

static int32_t UART3_DmaUninitialize(void)
{
    UART3_DeinitPins();
    return UART_DmaUninitialize(&uart3_DmaDriverState);
}

static int32_t UART3_DmaPowerControl(ARM_POWER_STATE state)
{
    return UART_DmaPowerControl(state, &uart3_DmaDriverState);
}

static int32_t UART3_DmaSend(const void *data, uint32_t num)
{
    return UART_DmaSend(data, num, &uart3_DmaDriverState);
}

static int32_t UART3_DmaReceive(void *data, uint32_t num)
{
    return UART_DmaReceive(data, num, &uart3_DmaDriverState);
}

static int32_t UART3_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_DmaTransfer(data_out, data_in, num, &uart3_DmaDriverState);
}

static uint32_t UART3_DmaGetTxCount(void)
{
    return UART_DmaGetTxCount(&uart3_DmaDriverState);
}

static uint32_t UART3_DmaGetRxCount(void)
{
    return UART_DmaGetRxCount(&uart3_DmaDriverState);
}

static int32_t UART3_DmaControl(uint32_t control, uint32_t arg)
{
    return UART_DmaControl(control, arg, &uart3_DmaDriverState);
}

static ARM_USART_STATUS UART3_DmaGetStatus(void)
{
    return UART_DmaGetStatus(&uart3_DmaDriverState);
}

/* uart3 Driver Control Block */
ARM_DRIVER_USART UART3_Dma_Driver = {
    UARTx_GetVersion, UARTx_GetCapabilities, UART3_DmaInitialize,   UART3_DmaUninitialize, UART3_DmaPowerControl,
    UART3_DmaSend,    UART3_DmaReceive,      UART3_DmaTransfer,     UART3_DmaGetTxCount,   UART3_DmaGetRxCount,
    UART3_DmaControl, UART3_DmaGetStatus,    UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_uart_edma_resource_t uart3_EdmaResource = {
    RTE_UART3_DMA_TX_DMA_BASE, RTE_UART3_DMA_TX_CH, RTE_UART3_DMA_TX_DMAMUX_BASE, RTE_UART3_DMA_TX_PERI_SEL,

    RTE_UART3_DMA_RX_DMA_BASE, RTE_UART3_DMA_RX_CH, RTE_UART3_DMA_RX_DMAMUX_BASE, RTE_UART3_DMA_RX_PERI_SEL,
};

uart_edma_handle_t UART3_EdmaHandle;
edma_handle_t UART3_EdmaRxHandle;
edma_handle_t UART3_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart3_edma_driver_state")
cmsis_uart_edma_driver_state_t uart3_EdmaDriverState = {
#else
cmsis_uart_edma_driver_state_t uart3_EdmaDriverState = {
#endif
    &uart3_Resource, &uart3_EdmaResource, &UART3_EdmaHandle, &UART3_EdmaRxHandle, &UART3_EdmaTxHandle,
};

static int32_t UART3_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART3_InitPins();
    return UART_EdmaInitialize(cb_event, &uart3_EdmaDriverState);
}

static int32_t UART3_EdmaUninitialize(void)
{
    UART3_DeinitPins();
    return UART_EdmaUninitialize(&uart3_EdmaDriverState);
}

static int32_t UART3_EdmaPowerControl(ARM_POWER_STATE state)
{
    return UART_EdmaPowerControl(state, &uart3_EdmaDriverState);
}

static int32_t UART3_EdmaSend(const void *data, uint32_t num)
{
    return UART_EdmaSend(data, num, &uart3_EdmaDriverState);
}

static int32_t UART3_EdmaReceive(void *data, uint32_t num)
{
    return UART_EdmaReceive(data, num, &uart3_EdmaDriverState);
}

