Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_uart_cmsis.c
static int32_t UART3_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_EdmaTransfer(data_out, data_in, num, &uart3_EdmaDriverState);
}

static uint32_t UART3_EdmaGetTxCount(void)
{
    return UART_EdmaGetTxCount(&uart3_EdmaDriverState);
}

static uint32_t UART3_EdmaGetRxCount(void)
{
    return UART_EdmaGetRxCount(&uart3_EdmaDriverState);
}

static int32_t UART3_EdmaControl(uint32_t control, uint32_t arg)
{
    return UART_EdmaControl(control, arg, &uart3_EdmaDriverState);
}

static ARM_USART_STATUS UART3_EdmaGetStatus(void)
{
    return UART_EdmaGetStatus(&uart3_EdmaDriverState);
}

/* uart3 Driver Control Block */
ARM_DRIVER_USART UART3_Edma_Driver = {
    UARTx_GetVersion,  UARTx_GetCapabilities, UART3_EdmaInitialize,  UART3_EdmaUninitialize, UART3_EdmaPowerControl,
    UART3_EdmaSend,    UART3_EdmaReceive,     UART3_EdmaTransfer,    UART3_EdmaGetTxCount,   UART3_EdmaGetRxCount,
    UART3_EdmaControl, UART3_EdmaGetStatus,   UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /* uart3 */

#if defined(UART4)

extern uint32_t UART4_GetFreq(void);
extern void UART4_InitPins(void);
extern void UART4_DeinitPins(void);

cmsis_uart_resource_t uart4_Resource = {UART4, UART4_GetFreq};

uart_handle_t UART4_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart4_non_blocking_driver_state")
cmsis_uart_interrupt_driver_state_t uart4_NonBlockingDriverState = {
#else
cmsis_uart_interrupt_driver_state_t uart4_NonBlockingDriverState = {
#endif
    &uart4_Resource, &UART4_Handle,
};

static int32_t UART4_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART4_InitPins();
    return UART_NonBlockingInitialize(cb_event, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingUninitialize(void)
{
    UART4_DeinitPins();
    return UART_NonBlockingUninitialize(&uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    return UART_NonBlockingPowerControl(state, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingSend(const void *data, uint32_t num)
{
    return UART_NonBlockingSend(data, num, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingReceive(void *data, uint32_t num)
{
    return UART_NonBlockingReceive(data, num, &uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_NonBlockingTransfer(data_out, data_in, num, &uart4_NonBlockingDriverState);
}

static uint32_t UART4_NonBlockingGetTxCount(void)
{
    return UART_NonBlockingGetTxCount(&uart4_NonBlockingDriverState);
}

static uint32_t UART4_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart4_NonBlockingDriverState);
}

static int32_t UART4_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return UART_NonBlockingControl(control, arg, &uart4_NonBlockingDriverState);
}

static ARM_USART_STATUS UART4_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart4_NonBlockingDriverState);
}

/* uart4 Driver Control Block */
ARM_DRIVER_USART UART4_NonBlocking_Driver = {UARTx_GetVersion,
                                             UARTx_GetCapabilities,
                                             UART4_NonBlockingInitialize,
                                             UART4_NonBlockingUninitialize,
                                             UART4_NonBlockingPowerControl,
                                             UART4_NonBlockingSend,
                                             UART4_NonBlockingReceive,
                                             UART4_NonBlockingTransfer,
                                             UART4_NonBlockingGetTxCount,
                                             UART4_NonBlockingGetRxCount,
                                             UART4_NonBlockingControl,
                                             UART4_NonBlockingGetStatus,
                                             UARTx_SetModemControl,
                                             UARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_uart_dma_resource_t uart4_DmaResource = {
    RTE_UART4_DMA_TX_DMA_BASE, RTE_UART4_DMA_TX_CH, RTE_UART4_DMA_TX_DMAMUX_BASE, RTE_UART4_DMA_TX_PERI_SEL,

    RTE_UART4_DMA_RX_DMA_BASE, RTE_UART4_DMA_RX_CH, RTE_UART4_DMA_RX_DMAMUX_BASE, RTE_UART4_DMA_RX_PERI_SEL,
};

uart_dma_handle_t UART4_DmaHandle;
dma_handle_t UART4_DmaRxHandle;
dma_handle_t UART4_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart4_dma_driver_state")
cmsis_uart_dma_driver_state_t uart4_DmaDriverState = {
#else
cmsis_uart_dma_driver_state_t uart4_DmaDriverState = {
#endif
    &uart4_Resource, &uart4_DmaResource, &UART4_DmaHandle, &UART4_DmaRxHandle, &UART4_DmaTxHandle,
};

static int32_t UART4_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART4_InitPins();
    return UART_DmaInitialize(cb_event, &uart4_DmaDriverState);
}

static int32_t UART4_DmaUninitialize(void)
{
    UART4_DeinitPins();
    return UART_DmaUninitialize(&uart4_DmaDriverState);
}

static int32_t UART4_DmaPowerControl(ARM_POWER_STATE state)
{
    return UART_DmaPowerControl(state, &uart4_DmaDriverState);
}

static int32_t UART4_DmaSend(const void *data, uint32_t num)
{
    return UART_DmaSend(data, num, &uart4_DmaDriverState);
}

static int32_t UART4_DmaReceive(void *data, uint32_t num)
{
    return UART_DmaReceive(data, num, &uart4_DmaDriverState);
}

static int32_t UART4_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_DmaTransfer(data_out, data_in, num, &uart4_DmaDriverState);
}

static uint32_t UART4_DmaGetTxCount(void)
{
    return UART_DmaGetTxCount(&uart4_DmaDriverState);
}

static uint32_t UART4_DmaGetRxCount(void)
{
    return UART_DmaGetRxCount(&uart4_DmaDriverState);
}

static int32_t UART4_DmaControl(uint32_t control, uint32_t arg)
{
    return UART_DmaControl(control, arg, &uart4_DmaDriverState);
}

static ARM_USART_STATUS UART4_DmaGetStatus(void)
{
    return UART_DmaGetStatus(&uart4_DmaDriverState);
}

/* uart4 Driver Control Block */
ARM_DRIVER_USART UART4_Dma_Driver = {
    UARTx_GetVersion, UARTx_GetCapabilities, UART4_DmaInitialize,   UART4_DmaUninitialize, UART4_DmaPowerControl,
    UART4_DmaSend,    UART4_DmaReceive,      UART4_DmaTransfer,     UART4_DmaGetTxCount,   UART4_DmaGetRxCount,
    UART4_DmaControl, UART4_DmaGetStatus,    UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_uart_edma_resource_t uart4_EdmaResource = {
    RTE_UART4_DMA_TX_DMA_BASE, RTE_UART4_DMA_TX_CH, RTE_UART4_DMA_TX_DMAMUX_BASE, RTE_UART4_DMA_TX_PERI_SEL,

