Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_uart_cmsis.c
    RTE_UART4_DMA_RX_DMA_BASE, RTE_UART4_DMA_RX_CH, RTE_UART4_DMA_RX_DMAMUX_BASE, RTE_UART4_DMA_RX_PERI_SEL,
};

uart_edma_handle_t UART4_EdmaHandle;
edma_handle_t UART4_EdmaRxHandle;
edma_handle_t UART4_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart4_edma_driver_state")
cmsis_uart_edma_driver_state_t uart4_EdmaDriverState = {
#else
cmsis_uart_edma_driver_state_t uart4_EdmaDriverState = {
#endif
    &uart4_Resource, &uart4_EdmaResource, &UART4_EdmaHandle, &UART4_EdmaRxHandle, &UART4_EdmaTxHandle,
};

static int32_t UART4_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART4_InitPins();
    return UART_EdmaInitialize(cb_event, &uart4_EdmaDriverState);
}

static int32_t UART4_EdmaUninitialize(void)
{
    UART4_DeinitPins();
    return UART_EdmaUninitialize(&uart4_EdmaDriverState);
}

static int32_t UART4_EdmaPowerControl(ARM_POWER_STATE state)
{
    return UART_EdmaPowerControl(state, &uart4_EdmaDriverState);
}

static int32_t UART4_EdmaSend(const void *data, uint32_t num)
{
    return UART_EdmaSend(data, num, &uart4_EdmaDriverState);
}

static int32_t UART4_EdmaReceive(void *data, uint32_t num)
{
    return UART_EdmaReceive(data, num, &uart4_EdmaDriverState);
}

static int32_t UART4_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_EdmaTransfer(data_out, data_in, num, &uart4_EdmaDriverState);
}

static uint32_t UART4_EdmaGetTxCount(void)
{
    return UART_EdmaGetTxCount(&uart4_EdmaDriverState);
}

static uint32_t UART4_EdmaGetRxCount(void)
{
    return UART_EdmaGetRxCount(&uart4_EdmaDriverState);
}

static int32_t UART4_EdmaControl(uint32_t control, uint32_t arg)
{
    return UART_EdmaControl(control, arg, &uart4_EdmaDriverState);
}

static ARM_USART_STATUS UART4_EdmaGetStatus(void)
{
    return UART_EdmaGetStatus(&uart4_EdmaDriverState);
}

/* uart4 Driver Control Block */
ARM_DRIVER_USART UART4_Edma_Driver = {
    UARTx_GetVersion,  UARTx_GetCapabilities, UART4_EdmaInitialize,  UART4_EdmaUninitialize, UART4_EdmaPowerControl,
    UART4_EdmaSend,    UART4_EdmaReceive,     UART4_EdmaTransfer,    UART4_EdmaGetTxCount,   UART4_EdmaGetRxCount,
    UART4_EdmaControl, UART4_EdmaGetStatus,   UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /* uart4 */

#if defined(UART5)

extern uint32_t UART5_GetFreq(void);
extern void UART5_InitPins(void);
extern void UART5_DeinitPins(void);

cmsis_uart_resource_t uart5_Resource = {UART5, UART5_GetFreq};

uart_handle_t UART5_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart5_non_blocking_driver_state")
cmsis_uart_interrupt_driver_state_t uart5_NonBlockingDriverState = {
#else
cmsis_uart_interrupt_driver_state_t uart5_NonBlockingDriverState = {
#endif
    &uart5_Resource, &UART5_Handle,
};

static int32_t UART5_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART5_InitPins();
    return UART_NonBlockingInitialize(cb_event, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingUninitialize(void)
{
    UART5_DeinitPins();
    return UART_NonBlockingUninitialize(&uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    return UART_NonBlockingPowerControl(state, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingSend(const void *data, uint32_t num)
{
    return UART_NonBlockingSend(data, num, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingReceive(void *data, uint32_t num)
{
    return UART_NonBlockingReceive(data, num, &uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_NonBlockingTransfer(data_out, data_in, num, &uart5_NonBlockingDriverState);
}

static uint32_t UART5_NonBlockingGetTxCount(void)
{
    return UART_NonBlockingGetTxCount(&uart5_NonBlockingDriverState);
}

static uint32_t UART5_NonBlockingGetRxCount(void)
{
    return UART_NonBlockingGetRxCount(&uart5_NonBlockingDriverState);
}

static int32_t UART5_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return UART_NonBlockingControl(control, arg, &uart5_NonBlockingDriverState);
}

static ARM_USART_STATUS UART5_NonBlockingGetStatus(void)
{
    return UART_NonBlockingGetStatus(&uart5_NonBlockingDriverState);
}

/* uart5 Driver Control Block */
ARM_DRIVER_USART UART5_NonBlocking_Driver = {UARTx_GetVersion,
                                             UARTx_GetCapabilities,
                                             UART5_NonBlockingInitialize,
                                             UART5_NonBlockingUninitialize,
                                             UART5_NonBlockingPowerControl,
                                             UART5_NonBlockingSend,
                                             UART5_NonBlockingReceive,
                                             UART5_NonBlockingTransfer,
                                             UART5_NonBlockingGetTxCount,
                                             UART5_NonBlockingGetRxCount,
                                             UART5_NonBlockingControl,
                                             UART5_NonBlockingGetStatus,
                                             UARTx_SetModemControl,
                                             UARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_uart_dma_resource_t uart5_DmaResource = {
    RTE_UART5_DMA_TX_DMA_BASE, RTE_UART5_DMA_TX_CH, RTE_UART5_DMA_TX_DMAMUX_BASE, RTE_UART5_DMA_TX_PERI_SEL,

    RTE_UART5_DMA_RX_DMA_BASE, RTE_UART5_DMA_RX_CH, RTE_UART5_DMA_RX_DMAMUX_BASE, RTE_UART5_DMA_RX_PERI_SEL,
};

uart_dma_handle_t UART5_DmaHandle;
dma_handle_t UART5_DmaRxHandle;
dma_handle_t UART5_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart5_dma_driver_state")
cmsis_uart_dma_driver_state_t uart5_DmaDriverState = {
#else
cmsis_uart_dma_driver_state_t uart5_DmaDriverState = {
#endif
    &uart5_Resource, &uart5_DmaResource, &UART5_DmaHandle, &UART5_DmaRxHandle, UART5_DmaTxHandle,
};

static int32_t UART5_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART5_InitPins();
    return UART_DmaInitialize(cb_event, &uart5_DmaDriverState);
}

static int32_t UART5_DmaUninitialize(void)
{
    UART5_DeinitPins();
    return UART_DmaUninitialize(&uart5_DmaDriverState);
}

static int32_t UART5_DmaPowerControl(ARM_POWER_STATE state)
{
    return UART_DmaPowerControl(state, &uart5_DmaDriverState);
}

