Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_uart_cmsis.c
static int32_t UART5_DmaSend(const void *data, uint32_t num)
{
    return UART_DmaSend(data, num, &uart5_DmaDriverState);
}

static int32_t UART5_DmaReceive(void *data, uint32_t num)
{
    return UART_DmaReceive(data, num, &uart5_DmaDriverState);
}

static int32_t UART5_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_DmaTransfer(data_out, data_in, num, &uart5_DmaDriverState);
}

static uint32_t UART5_DmaGetTxCount(void)
{
    return UART_DmaGetTxCount(&uart5_DmaDriverState);
}

static uint32_t UART5_DmaGetRxCount(void)
{
    return UART_DmaGetRxCount(&uart5_DmaDriverState);
}

static int32_t UART5_DmaControl(uint32_t control, uint32_t arg)
{
    return UART_DmaControl(control, arg, &uart5_DmaDriverState);
}

static ARM_USART_STATUS UART5_DmaGetStatus(void)
{
    return UART_DmaGetStatus(&uart5_DmaDriverState);
}

/* uart5 Driver Control Block */
ARM_DRIVER_USART UART5_Dma_Driver = {
    UARTx_GetVersion, UARTx_GetCapabilities, UART5_DmaInitialize,   UART5_DmaUninitialize, UART5_DmaPowerControl,
    UART5_DmaSend,    UART5_DmaReceive,      UART5_DmaTransfer,     UART5_DmaGetTxCount,   UART5_DmaGetRxCount,
    UART5_DmaControl, UART5_DmaGetStatus,    UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_uart_edma_resource_t uart5_EdmaResource = {
    RTE_UART5_DMA_TX_DMA_BASE, RTE_UART5_DMA_TX_CH, RTE_UART5_DMA_TX_DMAMUX_BASE, RTE_UART5_DMA_TX_PERI_SEL,

    RTE_UART5_DMA_RX_DMA_BASE, RTE_UART5_DMA_RX_CH, RTE_UART5_DMA_RX_DMAMUX_BASE, RTE_UART5_DMA_RX_PERI_SEL,
};

uart_edma_handle_t UART5_EdmaHandle;
edma_handle_t UART5_EdmaRxHandle;
edma_handle_t UART5_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart5_edma_driver_state")
cmsis_uart_edma_driver_state_t uart5_EdmaDriverState = {
#else
cmsis_uart_edma_driver_state_t uart5_EdmaDriverState = {
#endif
    &uart5_Resource, &uart5_EdmaResource, &UART5_EdmaHandle, &UART5_EdmaRxHandle, &UART5_EdmaTxHandle,
};

static int32_t UART5_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART5_InitPins();
    return UART_EdmaInitialize(cb_event, &uart5_EdmaDriverState);
}

static int32_t UART5_EdmaUninitialize(void)
{
    UART5_DeinitPins();
    return UART_EdmaUninitialize(&uart5_EdmaDriverState);
}

static int32_t UART5_EdmaPowerControl(ARM_POWER_STATE state)
{
    return UART_EdmaPowerControl(state, &uart5_EdmaDriverState);
}

static int32_t UART5_EdmaSend(const void *data, uint32_t num)
{
    return UART_EdmaSend(data, num, &uart5_EdmaDriverState);
}

static int32_t UART5_EdmaReceive(void *data, uint32_t num)
{
    return UART_EdmaReceive(data, num, &uart5_EdmaDriverState);
}

static int32_t UART5_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return UART_EdmaTransfer(data_out, data_in, num, &uart5_EdmaDriverState);
}

static uint32_t UART5_EdmaGetTxCount(void)
{
    return UART_EdmaGetTxCount(&uart5_EdmaDriverState);
}

static uint32_t UART5_EdmaGetRxCount(void)
{
    return UART_EdmaGetRxCount(&uart5_EdmaDriverState);
}

static int32_t UART5_EdmaControl(uint32_t control, uint32_t arg)
{
    return UART_EdmaControl(control, arg, &uart5_EdmaDriverState);
}

static ARM_USART_STATUS UART5_EdmaGetStatus(void)
{
    return UART_EdmaGetStatus(&uart5_EdmaDriverState);
}

/* uart5 Driver Control Block */
ARM_DRIVER_USART UART5_Edma_Driver = {
    UARTx_GetVersion,  UARTx_GetCapabilities, UART5_EdmaInitialize,  UART5_EdmaUninitialize, UART5_EdmaPowerControl,
    UART5_EdmaSend,    UART5_EdmaReceive,     UART5_EdmaTransfer,    UART5_EdmaGetTxCount,   UART5_EdmaGetRxCount,
    UART5_EdmaControl, UART5_EdmaGetStatus,   UARTx_SetModemControl, UARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /* uart5 */
